# CMD requirements:
lsof      # needed for should-restart
nftables  # for firewall
python
dialog
entr      # needed for codeshell
python-pydbus # for sig-gui.py

# Utilities
xclip        # for X system
wl-clipboard # for wayland
which
tree
sudo
neovim
vim
cpupower
criu         # Utilities to checkpoint and restore processes in userspace
whois
parallel
htop
lshw
ripgrep      # grep foo . -R (rg foo)
ripgrep-all
fd           # find . -name '*foo*'
jq           # JSON processor

# Shells
zsh
zsh-completions
fish
nushell
bash-completion

# Networking
nethogs
wget
ethtool   # Utility for controlling network drivers and hardware
dhclient  # for ./bin/net and ./bin/net.ns

# Coding
git
curl
ninja
cmake
boost
autoconf
automake
google-glog
gtest
fmt
indent   # C language source code formatting program
strace
distcc
ccache
check
perf
lldb
